\input{preambula_labs}
\begin{document}
\thispagestyle{empty}
\begin{center}
\LARGE{Университет ИТМО} 
\vspace{20pt}

\LARGE{Факультет программной инженерии и компьютерной техники \\
Образовательная программа системное и прикладное программное обеспечение}
\vspace{160pt}

\LARGE{Лабораторная работа  \textnumero 1 \\
По дисциплине "Программирование" \\ 
Вариант 29826}
\vspace{120pt}
\end{center}

\begin{flushright}
\LARGE{Выполнил студент группы P3109 \\ 
Евграфов Артём Андреевич \\
Преподаватель: \\
Мустафаева Айнур Вугар кызы}
\vspace{120pt}
\end{flushright}

\begin{center}
\Large{Санкт-Петербург 2024}
\end{center}

\newpage
\setcounter{page}{1}
\tableofcontents
\newpage
\section{Задание варианта 29826}
\Large{Написать программу на языке Java, выполняющую указанные в варианте действия. \\
Требования к программе: \\
1. Программа должна корректно запускаться, выполняться и выдавать результат. Программа не должна выдавать ошибки. Программа должна быть работоспособной именно во время проверки, то, что она работала 5 минут назад, дома или в параллельной вселенной оправданием не является. \\
2. Выражение должно вычисляться в соответствии с правилами вычисления математических выражений (должен соблюдаться порядок выполнения действий и т.д.). \\
3. Программа должна использовать математические функции из стандартной библиотеки Java. \\
4. Вычисление очередного элемента двумерного массива должно быть реализовано в виде отдельного статического метода. \\
5. Результат вычисления выражения должен быть выведен в стандартный поток вывода в виде матрицы с элементами в указанном в варианте формате. Вывод матрицы реализовать в виде отдельного статического метода. \\
6. Программа должна быть упакована в исполняемый jar-архив. \\
7. Выполнение программы необходимо продемонстрировать на сервере helios. \\[2mm]
Задание: \\
1. Создать одномерный массив z типа long. Заполнить его нечётными числами от 5 до 17 включительно в порядке убывания. \\[1mm]
2. Создать одномерный массив x типа double. Заполнить его 10-ю случайными числами в диапазоне от -13.0 до 9.0. \\[1mm]
3. Создать двумерный массив z размером $7\times10$. Вычислить его элементы по следующей формуле (где $x = x_{j}$):
\\[1mm]
$\bullet$ Если $z[i] = 9$, то $z[i][j] = 2 \cdot \arctan{\left( {\frac{1}{e^{{\left| x \right|}}}} \right)}$; \\[1mm]
$\bullet$ Если $z[i] \in \{5, 7, 15\}$, то $z[i][j] = \tan{\left({\left( {\left( {\frac{x}{1-x}} \right)}^2 \right)}^{{\left( 0.25\cdot(x+1) \right)}^{2}}\right)};$ \\[1mm]
$\bullet$ Для остальных значений $z[i]$: $z[i][j] = \cos{\lr{\frac{\frac{3}{4}}{\tan{\lr{\cos{\lr{x}}}} - 1}}}$. \\[1mm]
4. Напечатать полученный в результате массив в формате с пятью знаками после запятой.}
\newpage
\section{Исходный код программы}
\normalsize
\begin{lstlisting}[caption={Исходный код программы}, language=Java, captionpos=b]
import java.util.Random;
import static java.lang.Math. *;

public class Lab {
    private static void generate(long[] z) {
        for (int i = 0; i <= 6; i++) {
            z[i] = 17 - i * 2;
        }
    }
    private static void generate(double[] x, Random random) {
        for (int i = 0; i < 10; i++) {
            x[i] = -13.0 + 22.0 * random.nextDouble(); 
        }
    }
    private static void generate(double[][] z1, double[] x, long[] z) {
        for (int i = 0; i < 7; i++) {
            for (int j = 0; j < 10; j ++) {
                switch ((int) z[i]) { 
                    case 9:
                        z1[i][j] = 2 * atan(1 / (pow(E, abs(x[j]))));
                        break;
                    case 5, 7, 15:
                        z1[i][j] = tan(pow(pow((x[j] / (1 - 
                        x[j])), 2), pow(0.25 * (x[j] + 1), 2)));
                        break;
                    default:
                        z1[i][j] = cos((3.0 / 4.0) / (tan(cos(x[j])) - 1));
                }
            }
        }
    }
    private static void printing(double[][] mass) {
        for (double[] row : mass) {
            for (double el : row) {
                System.out.printf("%9.5f", el); 
            }
            System.out.println();
        }
    }
    public static void main(String[] args) {
        Random random = new Random(); 
        long[] z = new long[7]; 
        double[] x = new double[10];
        double[][] z1 = new double[7][10];

        generate(z); 
        generate(x, random);
        generate(z1, x, z);

        printing(z1);
    }
}
\end{lstlisting}

\section{Результат работы программы}
\subsection{Результат 1}
\[
\normalsize
\begin{array}{r@{\hspace{0.3cm}}r@{\hspace{0.3cm}}r@{\hspace{0.3cm}}r@{\hspace{0.3cm}}r@{\hspace{0.3cm}}r@{\hspace{0.3cm}}r@{\hspace{0.3cm}}r@{\hspace{0.3cm}}r@{\hspace{0.3cm}}r}
0{,}73735 & 0{,}86941 & 0{,}99097 & -0{,}11412 & 0{,}90721 & 0{,}60166 & 0{,}95730 & -0{,}78246 & 0{,}89798 & -0{,}02496 \\ 
0{,}87487 & 0{,}50693 & -0{,}22471 & -0{,}08007 & 0{,}38388 & 0{,}34195 & -1{,}18122 & 0{,}77382 & 1{,}35855 & -0{,}35872 \\ 
0{,}73735 & 0{,}86941 & 0{,}99097 & -0{,}11412 & 0{,}90721 & 0{,}60166 & 0{,}95730 & -0{,}78246 & 0{,}89798 & -0{,}02496 \\ 
0{,}73735 & 0{,}86941 & 0{,}99097 & -0{,}11412 & 0{,}90721 & 0{,}60166 & 0{,}95730 & -0{,}78246 & 0{,}89798 & -0{,}02496 \\ 
0{,}01817 & 0{,}00050 & 0{,}00735 & 0{,}00486 & 0{,}00007 & 0{,}00003 & 0{,}08675 & 0{,}00854 & 0{,}22476 & 0{,}01080 \\ 0{,}87487 & 0{,}50693 & -0{,}22471 & -0{,}08007 & 0{,}38388 & 0{,}34195 & -1{,}18122 & 0{,}77382 & 1{,}35855 & -0{,}35872 \\ 
0{,}87487 & 0{,}50693 & -0{,}22471 & -0{,}08007 & 0{,}38388 & 0{,}34195 & -1{,}18122 & 0{,}77382 & 1{,}35855 & -0{,}35872
\end{array}
\]
\subsection{Результат 2}
\[
\normalsize
\begin{array}{r@{\hspace{0.3cm}}r@{\hspace{0.3cm}}r@{\hspace{0.3cm}}r@{\hspace{0.3cm}}r@{\hspace{0.3cm}}r@{\hspace{0.3cm}}r@{\hspace{0.3cm}}r@{\hspace{0.3cm}}r@{\hspace{0.3cm}}r}
 -0{,}85822 & 0{,}78855 & 0{,}88952 & -0{,}49713 & 0{,}59891 & 0{,}88391 & -0{,}99775 & 0{,}94721 & -0{,}58088 & 0{,}45736 \\ 
 0{,}17711 & 0{,}89265 & 0{,}62356 & 1{,}54546 & -0{,}47156 & 1{,}26113 & 1{,}46650 & 0{,}40922 & 0{,}27176 & 1{,}54065 \\ -0{,}85822 & 0{,}78855 & 0{,}88952 & -0{,}49713 & 0{,}59891 & 0{,}88391 & -0{,}99775 & 0{,}94721 & -0{,}58088 & 0{,}45736 \\ 
 -0{,}85822 & 0{,}78855 & 0{,}88952 & -0{,}49713 & 0{,}59891 & 0{,}88391 & -0{,}99775 & 0{,}94721 & -0{,}58088 & 0{,}45736 \\ 
 0{,}00244 & 0{,}02050 & 0{,}00210 & 0{,}83506 & 0{,}01484 & 0{,}00046 & 1{,}11344 & 0{,}00011 & 0{,}00000 & 0{,}55270 \\ 0{,}17711 & 0{,}89265 & 0{,}62356 & 1{,}54546 & -0{,}47156 & 1{,}26113 & 1{,}46650 & 0{,}40922 & 0{,}27176 & 1{,}54065 \\ 0{,}17711 & 0{,}89265 & 0{,}62356 & 1{,}54546 & -0{,}47156 & 1{,}26113 & 1{,}46650 & 0{,}40922 & 0{,}27176 & 1{,}54065
\end{array}
\]

\section{Выводы по работе}
\Large
В ходе выполнения лабораторной работы я: \\
-Ознакомился с базовым синтаксисом языка Java, типами примитивных переменных; \\
-Реализовал цикл for; \\
-Ознакомился с IDE IntelliJ IDEA; \\
-Работал с одномерными и двумерными массивами; \\
-Научился подключать встроенные классы; \\
-Узнал об основных методах класса Math; \\
-Узнал о модификаторе static; \\
-Написал свой статичный метод; \\
-Научился пользоваться форматированным выводом; \\
-Создал jar-архив.
\end{document}
